package oop_dz_2_v2;

import java.util.Arrays;

public class Afisha {
    String afisha[][] = {{"_____________", "________", "______", "_________"},
            {"|___День____|", "_Фильм__|", "Сеанс|", "__Зал___|"},
            {"|Понедельник|", "Сталкер |", "10:00|", "Основной|"},
            {"|Понедельник|", "Ясмин   |", "14:00|", "4D      |"},
            {"|Понедельник|", "Лолита  |", "18:00|", "Mini    |"},
            {"|Понедельник|", "Харакири|", "22:00|", "Основной|"},
            {"_____________", "_________", "______", "_________"},
            {"|Вторник    |", "Харакири|", "10:00|", "4D      |"},
            {"|Вторник    |", "Сталкер |", "14:00|", "Mini    |"},
            {"|Вторник    |", "Ясмин   |", "18:00|", "Основной|"},
            {"|Вторник    |", "Лолита  |", "22:00|", "4D      |"},
            {"_____________", "_________", "______", "_________"},
            {"|Среда      |", "Лолита  |", "10:00|", "Mini    |"},
            {"|Среда      |", "Харакири|", "14:00|", "Основной|"},
            {"|Среда      |", "Сталкер |", "18:00|", "4D      |"},
            {"|Среда      |", "Ясмин   |", "22:00|", "Mini    |"},
            {"_____________", "________", "______", "__________"}};

    public Afisha() {
    }

    public void afisha_in () {
        System.out.println("                   АФИША   ");
        System.out.println("   ТЕКУЩЕЕ РАСПИСАНИЕ ФИЛЬМОВ К ПРОСМОТРУ   ");
        Arrays.stream(afisha).map(Arrays::toString).forEach(System.out::println);
    }
}
